Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectPicker Class
 The AnalysisObjectPicker class can be used to prompt the user to do manual picks of analysis objects. The methods throw an exception if the user interrupts (cancels) the pick command.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.UI.AnalysisObjectPicker
 Namespace: Tekla.Structures.Analysis.UI
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class AnalysisObjectPicker
Public Class AnalysisObjectPicker
The AnalysisObjectPicker type exposes the following members.
Constructors
Name | Description
AnalysisObjectPicker
Initializes a new instance of the AnalysisObjectPicker class
Top
Methods
Name | Description
PickObject
 Prompts the user to pick object from the model with the given prompt. Object is either analysis object or model object.
PickObjects
 Prompts the user to pick objects from the model with the given prompt.
Top
See Also
Reference
Tekla.Structures.Analysis.UI Namespace